cf/InformationRegisters/IndividualsDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>IndividualsDocuments</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Series</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WhoIssued</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DepartmentCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsIdentityDocument</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Presentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DocumentKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IndividualsDocumentsKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/IndividualsDocuments/Ext/RecordSetModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

Procedure BeforeWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	TextSeries			= NStr("en=', series: %1';			ru=', серия: %1'");
	TextNumber			= NStr("en=', No.%1';				ru=', № %1'");
	TextIssuanceDate	= NStr("en=', issued: %1 year';		ru=', выдан: %1 года'");
	TextValidityPeriod	= NStr("en=', valid till: %1 year';	ru=', действует до: %1 года'");
	TextDepartmentCode	= NStr("en=', div. No.%1';			ru=', № подр. %1'");
	
	For Each Record IN ThisObject Do
		If Record.DocumentKind.IsEmpty() Then
			Record.Presentation = "";
			
		Else
			Record.Presentation = ""
				+ Record.DocumentKind
				+ ?(ValueIsFilled(Record.Series), StringFunctionsClientServer.SubstituteParametersInString(TextSeries, Record.Series), "")
				+ ?(ValueIsFilled(Record.Number), StringFunctionsClientServer.SubstituteParametersInString(TextNumber, Record.Number), "")
				+ ?(ValueIsFilled(Record.IssueDate), StringFunctionsClientServer.SubstituteParametersInString(TextIssuanceDate, Format(Record.IssueDate,"DF=dd MMMM yyyy'")), "")
				+ ?(ValueIsFilled(Record.ValidityPeriod), StringFunctionsClientServer.SubstituteParametersInString(TextValidityPeriod, Format(Record.ValidityPeriod,"DF=dd MMMM yyyy'")), "")
				+ ?(ValueIsFilled(Record.WhoIssued), ", " + Record.WhoIssued, "")
				+ ?(ValueIsFilled(Record.DepartmentCode) AND Record.DocumentKind = Catalogs.IndividualsDocumentsKinds.LocalPassport, StringFunctionsClientServer.SubstituteParametersInString(TextDepartmentCode, Record.DepartmentCode), "");
			
		EndIf;
	EndDo;
	
EndProcedure

Procedure OnWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	Query = New Query;
	Query.SetParameter("DocumentsTable",	Unload(, "Ind, Period, IsIdentityDocument"));
	
	Query.Text =
	"SELECT
	|	DocumentsTable.Ind AS Ind,
	|	DocumentsTable.Period AS Period
	|INTO TU_Documents
	|FROM
	|	&DocumentsTable AS DocumentsTable
	|WHERE
	|	DocumentsTable.IsIdentityDocument
	|
	|INDEX BY
	|	Ind,
	|	Period
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	IndividualsDocuments.Ind AS Ind,
	|	IndividualsDocuments.Period AS Period,
	|	COUNT(IndividualsDocuments.Ind) AS DocumentsCount
	|FROM
	|	InformationRegister.IndividualsDocuments AS IndividualsDocuments
	|		INNER JOIN TU_Documents AS DocumentsSlice
	|		ON IndividualsDocuments.Period = DocumentsSlice.Period
	|			AND IndividualsDocuments.Ind = DocumentsSlice.Ind
	|			AND (IndividualsDocuments.IsIdentityDocument)
	|
	|GROUP BY
	|	IndividualsDocuments.Ind,
	|	IndividualsDocuments.Period
	|
	|HAVING
	|	COUNT(IndividualsDocuments.Ind) > 1";
	Selection = Query.Execute().Select();
	
	MessageText = NStr("en='The ID of %2 has been entered already as of 1%.';ru='На %1 у физлица %2 уже введен документ, удостоверяющий личность.'");
	
	While Selection.Next() Do
		Cancel = True;
		
		CommonUseClientServer.MessageToUser(StringFunctionsClientServer.SubstituteParametersInString(MessageText, Format(Selection.Period, "DLF=D"), Selection.Ind));
	EndDo;
	
EndProcedure

#EndIf
